In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101)

In [3]:
from pandas import DataFrame

In [4]:
df=DataFrame(randn(4,5),["A","B","C","D"],["V","W","X","Y","Z"])

In [5]:
df

          V         W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [7]:
df[['X','Y']]

          X         Y
A  0.907969  0.503826
B  0.605965 -2.018168
C  0.188695 -0.758872
D  1.978757  2.605967

In [11]:
df.iloc[0]

V    2.706850
W    0.628133
X    0.907969
Y    0.503826
Z    0.651118
Name: A, dtype: float64

In [15]:
df["New"]=df["W"]+df["Y"]

A    1.131958
B   -2.866245
C   -1.347873
D    2.796762
Name: New, dtype: float64

In [14]:
df

          V         W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  0.651118  1.131958
B -0.319318 -0.848077  0.605965 -2.018168  0.740122 -2.866245
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237 -1.347873
D  0.955057  0.190794  1.978757  2.605967  0.683509  2.796762

In [22]:
df.drop("New",axis=1,inplace=True)

In [23]:
df

          V         W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [24]:
df.drop("D",axis=0)

          V         W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237

In [25]:
df

          V         W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [26]:
df.loc[["A","B"]]

          V         W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122

In [27]:
df.loc["B"]["Y"]

-2.018168244037392

In [29]:
df.loc[["A","B"]][["X","Y"]]

          X         Y
A  0.907969  0.503826
B  0.605965 -2.018168

In [30]:
type(df)

pandas.core.frame.DataFrame

In [32]:
df.shape

(4, 5)

In [36]:
dr=df[df>0]

In [37]:
dr.dropna()

          V         W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [39]:
dr

          V         W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118
B       NaN       NaN  0.605965       NaN  0.740122
C  0.528813       NaN  0.188695       NaN       NaN
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [43]:
df[df['W']>0]

          V         W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118
D  0.955057  0.190794  1.978757  2.605967  0.683509

          V         W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [48]:
df>0

       V      W     X      Y      Z
A   True   True  True   True   True
B  False  False  True  False   True
C   True  False  True  False  False
D   True   True  True   True   True

In [49]:
df[df>0]

          V         W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118
B       NaN       NaN  0.605965       NaN  0.740122
C  0.528813       NaN  0.188695       NaN       NaN
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [50]:
df["V"]>0

A     True
B    False
C     True
D     True
Name: V, dtype: bool

In [52]:
df[df["V"]>0]

          V         W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [55]:
df[df['W']>0]['V']

A    2.706850
D    0.955057
Name: V, dtype: float64

In [54]:
df

          V         W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826  0.651118
B -0.319318 -0.848077  0.605965 -2.018168  0.740122
C  0.528813 -0.589001  0.188695 -0.758872 -0.933237
D  0.955057  0.190794  1.978757  2.605967  0.683509

In [56]:
df=pd.read_csv("USA_Housing.csv")

In [58]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 7 columns):
Avg. Area Income                5000 non-null float64
Avg. Area House Age             5000 non-null float64
Avg. Area Number of Rooms       5000 non-null float64
Avg. Area Number of Bedrooms    5000 non-null float64
Area Population                 5000 non-null float64
Price                           5000 non-null float64
Address                         5000 non-null object
dtypes: float64(6), object(1)
memory usage: 273.5+ KB

In [59]:
df.head()

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price,Address
0,79545.45857,5.682861,7.009188,4.09,23086.80050,1.059034e+06,"208 Michael Ferry Apt. 674\nLaurabury, NE 3701..."
1,79248.64245,6.002900,6.730821,3.09,40173.07217,1.505891e+06,"188 Johnson Views Suite 079\nLake Kathleen, CA..."
2,61287.06718,5.865890,8.512727,5.13,36882.15940,1.058988e+06,"9127 Elizabeth Stravenue\nDanieltown, WI 06482..."
3,63345.24005,7.188236,5.586729,3.26,34310.24283,1.260617e+06,USS Barnett\nFPO AP 44820
4,59982.19723,5.040555,7.839388,4.23,26354.10947,6.309435e+05,USNS Raymond\nFPO AE 09386

In [70]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
Avg. Area Income,5000.0,6.858311e+04,10657.991214,17796.631190,61480.562390,6.880429e+04,7.578334e+04,1.077017e+05
Avg. Area House Age,5000.0,5.977222e+00,0.991456,2.644304,5.322283,5.970429e+00,6.650808e+00,9.519088e+00
Avg. Area Number of Rooms,5000.0,6.987792e+00,1.005833,3.236194,6.299250,7.002902e+00,7.665871e+00,1.075959e+01
Avg. Area Number of Bedrooms,5000.0,3.981330e+00,1.234137,2.000000,3.140000,4.050000e+00,4.490000e+00,6.500000e+00
Area Population,5000.0,3.616352e+04,9925.650114,172.610686,29403.928700,3.619941e+04,4.286129e+04,6.962171e+04
Price,5000.0,1.232073e+06,353117.626584,15938.657920,997577.135075,1.232669e+06,1.471210e+06,2.469066e+06

In [72]:
dr1=df["Avg. Area Income"]

In [73]:
dr1.sum()

342915544.91985

In [76]:
dr1.median()

68804.28640499999

In [78]:
dr1.kurtosis()

0.045573821501244005

In [79]:
dr1.skew()

-0.03371997534048614

In [80]:
dr1.std()

10657.991213888688

In [81]:
dr1.var()

113592776.71532847